emacs/Emacs.org
#+TITLE: Emacs config
#+AUTHOR: Felix Dumbeck
#+STARTUP: fold
#+PROPERTY: header-args :emacs-lisp :tangle .config/emacs/init.el :results silent :mkdirp yes
#+auto_tangle: t

* preface
simple "performant" GNU Emacs 29.1+ [[https://leanpub.com/lit-config/read][literate config]] that uses as much built in stuff as possible and builds upon that where necessary
Works for me
* startup
** increase startup performance
*** increase garbage collection threshold
make garbage-collection less active by increasing its threshold during startup so Emacs starts up faster
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 50 1000 1000))      ;500mb
  (setq read-process-output-max (* 2 1024 1024)) ; 2mb
#+end_src
*** measure startup performance
in order to measure the time it takes for Emacs to startup use ~emacs-init-time~
see what packages are loaded at startup (*only have it enabled when debugging!*):
#+begin_src emacs-lisp :tangle no
  (setq debug-on-error t)
  (setq use-package-verbose t)
#+end_src
* package management
** enable melpa
Setup package repositories
#+begin_src emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (package-initialize)
  (require 'use-package-ensure) ;; make all use-package :ensure t
  (setq use-package-always-ensure t)
#+end_src
** upgrade built in packages
#+begin_src emacs-lisp
  (setq package-install-upgrade-built-in t)
#+end_src
* keep .config/emacs clean
stop transient files from being created in the Emacs config folder
** change location of the custom file
prevent Emacs from adding custom settings to init.el and choose =custom.el= instead
#+begin_src emacs-lisp
  (setq custom-file (locate-user-emacs-file "custom.el"))
  (load custom-file 'noerror 'nomessage)
#+end_src
** auto generated files in tmp directory
*** keep backup files in a temporary directory
#+begin_src emacs-lisp
  (setq backup-dir (expand-file-name "tmp/backups/" user-emacs-directory))
  (setq backup-directory-alist `(("." . , backup-dir)))
  (setq delete-old-versions t)
#+end_src
*** keep  auto-save files in a temporary directory
#+begin_src emacs-lisp
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*", (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))
#+end_src
* general
** user info
#+begin_src emacs-lisp
  (setq user-full-name "Felix Dumbeck"
        user-mail-address "felix@dumbeck.net")
#+end_src
** user interface
*** show scratch buffer on startup
#+begin_src emacs-lisp
  (setq inhibit-startup-screen t)
#+end_src
*** flash when the bell rings
to avoid Emacs making a sound on things like trying to scroll past the first line make it flash the screen instead
#+begin_src emacs-lisp
  (setq visible-bell t)
#+end_src
*** disable UI dialogs as prompts
#+begin_src emacs-lisp
  (setq use-dialog-box nil)
#+end_src
*** remove GUI elements
remove the menu-bar tool-bar and scroll-bar as a measure to remove visual clutter
#+begin_src emacs-lisp
  (menu-bar-mode 0)
  (tool-bar-mode 0)
  (scroll-bar-mode 0)
#+end_src
*** lines
**** highlight current line
#+begin_src emacs-lisp
  (global-hl-line-mode t)
#+end_src
**** enable line wrapping
#+begin_src emacs-lisp
  (global-visual-line-mode t)
#+end_src
**** show relative line numbers
#+begin_src emacs-lisp
  ;; (global-display-line-numbers-mode t) ;; enable line numbers globally
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
  (add-hook 'text-mode-hook #'display-line-numbers-mode)
  (add-hook 'org-mode-hook #'display-line-numbers-mode)
  ;;(setq display-line-numbers-type 'relative) ;; make line numbers relative
#+end_src
*** prettify symbols
#+begin_src emacs-lisp
  (global-prettify-symbols-mode t)
#+end_src
*** theme
**** cool themes (not used)
#+begin_src emacs-lisp :tangle no
  (use-package gruvbox-theme :defer)
  (use-package jazz-theme :defer)
  (use-package zenburn-theme)
  (use-package anti-zenburn-theme)
  (use-package hc-zenburn-theme)
  ;; (load-theme 'gruvbox-dark-hard t)
  ;; (load-theme 'gruvbox-light-soft t)
#+end_src
**** ef-themes
#+begin_src emacs-lisp
  (use-package ef-themes)
#+end_src
#+begin_src emacs-lisp :tangle no
  ;; (load-theme 'modus-operandi)
  ;; (load-theme 'ef-cherie t)
  ;; (load-theme 'ef-autumn t)
  ;; (load-theme 'ef-dark t)
  ;; (load-theme 'ef-rosa t)
  ;; (load-theme 'ef-spring t)
  ;; (load-theme 'ef-melissa-light t)
  ;; (load-theme 'ef-duo-light t)
  ;; (load-theme 'ef-duo-dark t)
  ;; (load-theme 'ef-night t)
  ;; (load-theme 'ef-bio t)
#+end_src
**** modus theme modifications
make modeline and frames boderless
for emacs 29:
#+begin_src emacs-lisp
  (setq modus-themes-mode-line '(borderless))
#+end_src
for emacs 30:
#+begin_src emacs-lisp
  (setq modus-themes-common-palette-overrides
        '((border-mode-line-active unspecified)
          (border-mode-line-inactive unspecified)))
#+end_src

#+begin_src emacs-lisp
  (setq modus-themes-fringes nil)
  (add-hook 'enable-theme-functions
            (lambda (&rest _) (set-face-foreground
                               'vertical-border (face-background 'default))))
#+end_src
**** auto pick theme
picks a light color-theme when the sun is risen and a dark theme when the sun is set
#+begin_src emacs-lisp
  (require 'ef-themes)
  (use-package circadian
    :if (display-graphic-p)
    :config
    (setq calendar-latitude 52.5)
    (setq calendar-longitude 13.4)
    (setq circadian-themes '(
                             ;; (:sunrise . modus-operandi-tinted) ;emacs 30
                             (:sunrise . modus-operandi)
                             ;; (:sunrise  . ef-day)
                             ;; (:sunset  . ef-night)
                             ;; (:sunset . ef-autumn)
  			   (:sunset . modus-vivendi)
                             ;; (:sunset . tango-dark)
                             ;; (:sunset . modus-vivendi)
                             ;; (:sunset . ef-owl)
                             ;; (:sunrise . tsdh-light)
                             ;; (:sunset . gruber-darker)
                             ;; (:sunrise . tango)
                             ;; (:sunset . deeper-blue)
                             ;; (:sunset . wheatgrass)
                             ;; (:sunset . manoj-dark)
                             ))
    (circadian-setup))
#+end_src
*** fonts
**** general font
#+begin_src emacs-lisp
  (set-frame-font "Comic Shanns Mono 14" nil t)
  ;; (set-frame-font "Serious Shanns NerdFont 14" nil t)
  ;; (set-frame-font "Fantasque Sans Mono 12" nil t)
  (add-to-list 'default-frame-alist '(font . "Comic Shanns Mono 14"))
#+end_src
**** icon font
#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+end_src
*** cursor style
#+begin_src emacs-lisp
  (setq-default cursor-type 'bar)
#+end_src
** mode-line
show the mode status line from doom Emacs at the bottom to provide more information while looking nicer
#+begin_src emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode t)
    :config
    (display-battery-mode)
    (setq display-time-24hr-format t)
    (display-time))
#+end_src
make it so mode line can be hidden by calling =hide-mode-line=
#+begin_src emacs-lisp :tangle no
  (use-package hide-mode-line
    :defer t
    :commands (hide-mode-line-mode))
#+end_src
** which-key
which-key is great for getting an overview of what keybindings are available based on the prefix keys you entered.
it shows a table of all possible ways you can finish a shortcut after having started one
#+begin_src emacs-lisp
  (use-package which-key
    ;; :ensure nil				;included in emacs 30+
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))
#+end_src
** various
*** join-lines with =C-x C-j=
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-j") 'join-line)
#+end_src
*** move to trash instead of deleting
the default trash dir is the xdg freedesktop location
#+begin_src emacs-lisp
  (setq delete-by-moving-to-trash t)
#+end_src
*** move current file to trash C-x x x x
#+begin_src emacs-lisp
  (defun move-current-file-to-trash ()
    (interactive)
    (when (eq major-mode 'dired-mode)
      (user-error "%s: In dired. Nothing is done." real-this-command))
    (move-file-to-trash buffer-file-name))
  (global-set-key (kbd "C-x x x") 'move-current-file-to-trash)
#+end_src
*** open switch-to-buffer with =C-x C-b=
=C-x C-b= same as =C-x b= because that's what i always want
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-b") 'switch-to-buffer)
#+end_src
*** show recently opened files first in minibuffers
#+begin_src emacs-lisp
  (recentf-mode t)
#+end_src
*** save last location in file
#+begin_src emacs-lisp
  (save-place-mode t)
#+end_src
*** always delete directories recursivly without asking
#+begin_src emacs-lisp
  (setq dired-recursive-deletes 'always)
#+end_src
*** replace selection
typed text replaces the selection if the selection is active, pressing delete or backspace deletes the selection
#+begin_src emacs-lisp
  (delete-selection-mode)
#+end_src
*** revert (update) buffers when the underlying file has changed
#+begin_src emacs-lisp
  (global-auto-revert-mode t)
  ;; revert dired and other buffers
  (setq global-auto-revert-non-file-buffers t)
#+end_src
*** dont overwrite system clipboard
save system clipboard before yanking
#+begin_src emacs-lisp
  (setq save-interprogram-paste-before-kill t)
#+end_src
*** yank (paste) when pressing C-z
because it is very confusing when switching between qwerty and qwertz and the window gets minimized
#+begin_src emacs-lisp
  (global-set-key (kbd "C-z") 'yank)
#+end_src
*** kill buffer and close window
kill the current buffer and close its window/frame with =C-x C-k=
#+begin_src emacs-lisp
  (defun kill-buffer-and-close-window ()
    "Kill the current buffer and close its window."
    (interactive)
    (kill-buffer)
    (delete-window))
  (global-set-key (kbd "C-x C-k") 'kill-buffer-and-close-window)
#+end_src
*** registers
**** append-to-register keybinding
useful when having multiple cursors, wanting to copy from all and pasting all contents at the location of only a single cursor
#+begin_src emacs-lisp
  (global-set-key (kbd "C-x r a") 'append-to-register)
#+end_src
**** empty-register
#+begin_src emacs-lisp
  (defun empty-register (register)
    "Clears out value from Emacs register."
    (interactive "cRegister: ")
    (set-register register nil))

  (global-set-key (kbd "C-x r e") 'empty-register)
#+end_src
