emacs/.config/emacs/init.el
(setq gc-cons-threshold (* 50 1000 1000))      ;500mb
(setq read-process-output-max (* 2 1024 1024)) ; 2mb

(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(package-initialize)
(require 'use-package-ensure) ;; make all use-package :ensure t
(setq use-package-always-ensure t)

(setq package-install-upgrade-built-in t)

(setq custom-file (locate-user-emacs-file "custom.el"))
(load custom-file 'noerror 'nomessage)

(setq backup-dir (expand-file-name "tmp/backups/" user-emacs-directory))
(setq backup-directory-alist `(("." . , backup-dir)))
(setq delete-old-versions t)

(make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)
(setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
      auto-save-file-name-transforms `((".*", (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

(setq user-full-name "Felix Dumbeck"
      user-mail-address "felix@dumbeck.net")

(setq inhibit-startup-screen t)

(setq visible-bell t)

(setq use-dialog-box nil)

(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)

(global-hl-line-mode t)

(global-visual-line-mode t)

;; (global-display-line-numbers-mode t) ;; enable line numbers globally
(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(add-hook 'text-mode-hook #'display-line-numbers-mode)
(add-hook 'org-mode-hook #'display-line-numbers-mode)
(setq display-line-numbers-type 'relative) ;; make line numbers relative

(global-prettify-symbols-mode t)

(use-package ef-themes)

(setq modus-themes-mode-line '(borderless))

(setq modus-themes-common-palette-overrides
      '((border-mode-line-active unspecified)
        (border-mode-line-inactive unspecified)))

(setq modus-themes-fringes nil)
(add-hook 'enable-theme-functions
          (lambda (&rest _) (set-face-foreground
                             'vertical-border (face-background 'default))))

(require 'ef-themes)
(use-package circadian
  :if (display-graphic-p)
  :config
  (setq calendar-latitude 52.5)
  (setq calendar-longitude 13.4)
  (setq circadian-themes '(
                           ;; (:sunrise . modus-operandi-tinted) ;emacs 30
                           (:sunrise . modus-operandi)
                           ;; (:sunrise  . ef-day)
                           ;; (:sunset  . ef-night)
                           ;; (:sunset  . ef-autumn)
                           ;; (:sunset . tango-dark)
                           (:sunset . modus-vivendi)
                           ;; (:sunset . ef-owl)
                           ;; (:sunrise . tsdh-light)
                           ;; (:sunset . gruber-darker)
                           ;; (:sunrise . tango)
                           ;; (:sunset . deeper-blue)
                           ;; (:sunset . wheatgrass)
                           ;; (:sunset . manoj-dark)
                           ))
  (circadian-setup))

;; (set-frame-font "Comic Shanns Mono 13" nil t)
(set-frame-font "Serious Shanns NerdFont 14" nil t)
;; (set-frame-font "Fantasque Sans Mono 12" nil t)
(add-to-list 'default-frame-alist '(font . "Serious Shanns NerdFont 14"))

(use-package all-the-icons
  :if (display-graphic-p))

(setq-default cursor-type 'bar)

(use-package doom-modeline
  :init (doom-modeline-mode t)
  :config
  (display-battery-mode)
  (setq display-time-24hr-format t)
  (display-time))

(use-package which-key
  ;; :ensure nil				;included in emacs 30+
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 1))

(global-set-key (kbd "C-x C-j") 'join-line)

(setq delete-by-moving-to-trash t)

(defun move-current-file-to-trash ()
  (interactive)
  (when (eq major-mode 'dired-mode)
    (user-error "%s: In dired. Nothing is done." real-this-command))
  (move-file-to-trash buffer-file-name))
(global-set-key (kbd "C-x x x") 'move-current-file-to-trash)

(global-set-key (kbd "C-x C-b") 'switch-to-buffer)

(recentf-mode t)

(save-place-mode t)

(setq dired-recursive-deletes 'always)

(delete-selection-mode)

(global-auto-revert-mode t)
;; revert dired and other buffers
(setq global-auto-revert-non-file-buffers t)

(setq save-interprogram-paste-before-kill t)

(global-set-key (kbd "C-z") 'yank)

(defun kill-buffer-and-close-window ()
  "Kill the current buffer and close its window."
  (interactive)
  (kill-buffer)
  (delete-window))
(global-set-key (kbd "C-x C-k") 'kill-buffer-and-close-window)
