emacs/Emacs.org
*** convert region from and to hexadecimal
#+begin_src emacs-lisp
  (defun convert-region-decimal-to-hexadecimal (start end)
    "Convert a region from decimal to hexadecimal."
    (interactive "r")
    (save-excursion
      (goto-char start)
      (while (< (point) end)
        (let ((num (thing-at-point 'word)))
          (when (string-match-p "^[0-9]+$" num)
            (delete-region (point) (+ (point) (length num)))
            (insert (format "0x%x" (string-to-number num)))))
        (forward-word))))
#+end_src
#+begin_src emacs-lisp
  (defun convert-region-hexadecimal-to-decimal (start end)
    "Convert a region from hexadecimal to decimal."
    (interactive "r")
    (save-excursion
      (goto-char start)
      (while (< (point) end)
        (let ((num (thing-at-point 'word)))
          (when (string-match-p "^0x[0-9a-fA-F]+$" num)
            (delete-region (point) (+ (point) (length num)))
            (insert (format "%d" (string-to-number (substring num 2) 16)))))
        (forward-word))))
#+end_src
#+begin_src emacs-lisp :tangle no
  (global-set-key (kbd "C-c h") 'convert-region-decimal-to-hexadecimal)
  (global-set-key (kbd "C-c d") 'convert-region-hexadecimal-to-decimal)
#+end_src
* completion system
** minibuffer completion
*** vertico: performant and minimalist vertical completion UI based on the default completion system for minibuffers
**** buffer auto-completion with vertico
#+begin_src emacs-lisp
  (use-package vertico
    :custom
    (vertico-scroll-margin 0) ;; Different scroll margin
    (vertico-count 10) ;; Show more candidatesm
    ;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
    (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
    :init
    (vertico-mode))
#+end_src
**** useful general emacs config
TODO: look into necessity
#+begin_src emacs-lisp
  ;; A few more useful configurations...
  (use-package emacs
    :ensure nil
    :custom
    (enable-recursive-minibuffers t)	;Support opening new minibuffers from inside existing minibuffers.
    ;; Emacs 28 and newer: Hide commands in M-x which do not work in the current
    ;; mode.  Vertico commands are hidden in normal buffers. This setting is
    ;; useful beyond Vertico.
    (read-extended-command-predicate #'command-completion-default-include-p)
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode))
#+end_src
**** candidate meta information with marginalia
show meta information about vertico completion options (eg. file size, last edited)
#+begin_src emacs-lisp
  (use-package marginalia
    :after vertico
    :init
    (marginalia-mode))
#+end_src
**** vertico show candidate icons
icons for completion options
#+begin_src emacs-lisp :tangle no
  (use-package all-the-icons-completion
    :after (all-the-icons marginalia)
    :init (all-the-icons-completion-mode)
    :hook (marginalia-mode . all-the-icons-completion-marginalia-setup))
#+end_src
**** set command history length
#+begin_src emacs-lisp
  (setq history-length 50)
  (savehist-mode t)
#+end_src
Persist history over Emacs restarts. Vertico sorts by history position.
#+begin_src emacs-lisp :tangle no
  (use-package savehist
    :init
    (savehist-mode))
#+end_src
*** consult: for seeing "occurrence-previews" when searching
#+begin_src emacs-lisp
  (use-package consult
    :bind (("C-c r" . consult-ripgrep)
           ("C-s" . consult-line))
    :config
    (keymap-set minibuffer-local-map "C-r" 'consult-history)
    (setq completion-in-region-function #'consult-completion-in-region))
#+end_src
** normal buffer completion
*** corfu: in-buffer completion UI on top of the built-in completion framework
**** main config
#+begin_src emacs-lisp
  (use-package corfu
    :custom
    (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    (corfu-auto t)                 ;; Enable auto completion
    (corfu-separator ?\s)          ;; Orderless field separator
    (corfu-auto-prefix 2) ;; show completions after two letters
    (corfu-auto-delay 0) ;; show completions immediatly
    ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
    ;; (corfu-preview-current nil)    ;; Disable current candidate preview
    ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
    ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
    ;; (corfu-scroll-margin 5)        ;; Use scroll margin
    :init
    (global-corfu-mode)
    (corfu-history-mode))
#+end_src
**** corfu-popupinfo-mode
show documentation and optionally source code in pop up buffer next to auto-completion
"M-n" #'corfu-doc-scroll-up
"M-p" #'corfu-doc-scroll-down)
#+begin_src emacs-lisp :tangle no
  (use-package corfu-info
    :after corfu
    :ensure nil
    :hook (corfu-mode . corfu-info-mode))
#+end_src
#+begin_src emacs-lisp
  (use-package corfu-popupinfo
    :after corfu
    :ensure nil
    :hook (corfu-mode . corfu-popupinfo-mode)
    :custom
    (corfu-popupinfo-delay '(0.6 . 0.4))
    (corfu-popupinfo-hide nil)
    :config
    (corfu-popupinfo-mode))
#+end_src
**** corfu-terminal
#+begin_src emacs-lisp
  (use-package corfu-terminal
    :if (not (display-graphic-p))
    :init
    (corfu-terminal-mode t))
#+end_src
**** nerd-icons-corfu
add nerd-font icons to corfu completion candidates
#+begin_src emacs-lisp
  (use-package nerd-icons-corfu
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src
**** enable auto-completions in eshell
#+begin_src emacs-lisp
  (add-hook 'eshell-mode-hook
            (lambda ()
              (setq-local corfu-auto nil)
              (corfu-mode)))
#+end_src
**** look into:
+ [[https://code.bsdgeek.org/adam/corfu-candidate-overlay][adam/corfu-candidate-overlay: Show first Corfu's completion candidate in an o...]]
*** cape: extend the built in completion at point functionality
#+begin_src emacs-lisp
  (use-package cape
    ;; Bind dedicated completion commands
    ;; Alternative prefix keys: C-c p, M-p, M-+, ...
    :bind (("C-c p p" . completion-at-point) ;; capf
           ("C-c p t" . complete-tag)        ;; etags
           ("C-c p d" . cape-dabbrev)        ;; or dabbrev-completion
           ("C-c p h" . cape-history)
           ("C-c p f" . cape-file)
           ("C-c p k" . cape-keyword)
           ("C-c p s" . cape-elisp-symbol)
           ("C-c p e" . cape-elisp-block)
           ("C-c p a" . cape-abbrev)
           ("C-c p l" . cape-line)
           ("C-c p w" . cape-dict)
           ("C-c p :" . cape-emoji);;; might be deleted
           ("C-c p \\" . cape-tex)
           ("C-c p _" . cape-tex)
           ("C-c p ^" . cape-tex)
           ("C-c p &" . cape-sgml)
           ("C-c p r" . cape-rfc1345))
    :init
    ;; Add to the global default value of `completion-at-point-functions' which is
    ;; used by `completion-at-point'.  The order of the functions matters, the
    ;; first function returning a result wins.  Note that the list of buffer-local
    ;; completion functions takes precedence over the global list.
    (add-to-list 'completion-at-point-functions #'cape-abbrev) ;Complete abbreviation (add-global-abbrev, add-mode-abbrev).
    (add-to-list 'completion-at-point-functions #'cape-dabbrev) ;Complete word from current buffers. See also dabbrev-capf on Emacs 29
    (add-to-list 'completion-at-point-functions #'cape-file)    ;Complete file name.
    (add-to-list 'completion-at-point-functions #'cape-elisp-block) ;Complete Elisp in Org or Markdown code block.
    (add-to-list 'completion-at-point-functions #'cape-history)	  ;Complete from Eshell, Comint or minibuffer history.
    (add-to-list 'completion-at-point-functions #'cape-keyword)	  ;Complete programming language keyword.
    ;;(add-to-list 'completion-at-point-functions #'cape-tex)
    ;;(add-to-list 'completion-at-point-functions #'cape-sgml)
    ;;(add-to-list 'completion-at-point-functions #'cape-rfc1345)
    (add-to-list 'completion-at-point-functions #'cape-dict) ;Complete word from dictionary file.
    ;; (add-to-list 'completion-at-point-functions #'cape-emoji)
    ;; (add-to-list 'completion-at-point-functions #'cape-elisp-symbol)
    ;;(add-to-list 'completion-at-point-functions #'cape-line)
    )
#+end_src
** improve candidate filtering with orderless
improve vertico and corfu completions by allowing matches to search terms differently ordered
#+begin_src emacs-lisp
  (use-package orderless
    :config
    (setq completion-styles '(orderless basic)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))
#+end_src
** other completion stuff
*** bash-completion
#+begin_src emacs-lisp
  (use-package bash-completion)
#+end_src
* org-mode
