emacs/.config/emacs/init.el
  :ensure nil				;load built in org-mode
  :commands (org-mode))

(defun unpropertize (string)
  "Removes all text properties from STRING."
  (set-text-properties 0 (length string) nil string) string)
(defun org-get-headings ()
  "Return a list of an org document's headings."
  (org-map-entries (lambda () (unpropertize (org-get-heading t t t t)))))
(defun org-insert-link-headline (header)
  "Insert internal link to HEADER entry in current file."
  (interactive (list (completing-read "Link: " (org-get-headings) nil nil)))
  (org-insert-link nil header))
;; (define-key org-mode-map (kbd "C-c h") 'org-insert-link-headline)

(defun transform-comments (backend)
  (while (re-search-forward "[:blank:]*# " nil t)
    (replace-match "#+LATEX: % ")))
(add-hook 'org-export-before-parsing-hook #'transform-comments)

(setq org-startup-folded t)

(use-package org-cliplink
  :bind ("C-x p i" . org-cliplink))

(use-package ox-hugo
  :after org-mode
  :commands org-hugo-auto-export-mode)

(add-hook 'org-mode-hook
          (lambda ()
            (local-set-key (kbd "M-F") 'org-shiftmetaright)))
(add-hook 'org-mode-hook
          (lambda ()
            (local-set-key (kbd "M-B") 'org-shiftmetaleft)))
(add-hook 'org-mode-hook
          (lambda ()
            (local-set-key (kbd "M-P") 'org-move-subtree-up)))
(add-hook 'org-mode-hook
          (lambda ()
            (local-set-key (kbd "M-N") 'org-move-subtree-down)))

(setq org-startup-indented t
      org-pretty-entities t
      org-hide-emphasis-markers t
      org-startup-with-inline-images t
      org-image-actual-width '(300))

(use-package org-appear
  :hook (org-mode . org-appear-mode))

(custom-set-faces
 '(org-level-1 ((t (:height 1.75))))
 '(org-level-2 ((t (:height 1.5))))
 '(org-level-3 ((t (:height 1.25))))
 '(org-level-4 ((t (:height 1.1))))
 '(org-document-title ((t (:height 1.5)))))

(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src sh"))
(add-to-list 'org-structure-template-alist '("ba" . "src bash"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("li" . "src lisp"))
(add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
(add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("go" . "src go"))
(add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
(add-to-list 'org-structure-template-alist '("json" . "src json"))
(add-to-list 'org-structure-template-alist '("tex" . "src latex"))
(add-to-list 'org-structure-template-alist '("rs" . "src rust"))

(setq org-confirm-babel-evaluate nil)

(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t)))

(use-package org-roam
  :custom
  (org-roam-directory (file-truename "~/Notes"))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n g" . org-roam-graph)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ;; Dailies
         ("C-c n j" . org-roam-dailies-capture-today))
  :config
  ;; If you're using a vertical completion framework, you might want a more informative completion interface
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-autosync-mode))

(global-set-key (kbd "C-c a") #'org-agenda)

(setq org-agenda-start-day "0d")
(setq org-agenda-span 20)
(setq org-agenda-start-on-weekday nil)

(setq org-agenda-files
      '("~/uni/uni.org"
        "~/uni/personal.org"))

(add-hook 'prog-mode-hook #'hs-minor-mode)
(global-set-key (kbd "C-c C-h") 'hs-hide-block)
(global-set-key (kbd "C-c C-s") 'hs-show-block)
(global-set-key (kbd "C-c C-t") 'hs-toggle-hiding)
(global-set-key (kbd "C-<tab>") 'hs-toggle-hiding)
(global-set-key (kbd "C-c C-a") 'hs-show-all)
(global-set-key (kbd "C-c C-l") 'hs-hide-all)

(defun kill-line-backward ()
  "Kill line backwards from the position of the pointer to the beginning of the line."
  (interactive)
  (kill-line 0))
(global-set-key (kbd "C-S-k") 'kill-line-backward)

(use-package multiple-cursors
  :bind (("C-;" . mc/edit-lines)
         ("C-S-c C-S-c" . mc/edit-lines)
         ("C->" . mc/mark-next-like-this)
         ("C-<" . mc/mark-previous-like-this)
         ("C-c C-<" . mc/mark-all-like-this))
  :init
  (setq  mc/match-cursor-style nil))

;; use on normal systems
(use-package jinx
  :if (not (file-directory-p "~/.guix-profile/share/emacs/site-lisp")) ;only install on non guix system
  :hook (emacs-startup . global-jinx-mode)
  :bind (("M-$" . jinx-correct)
         ("C-M-$" . jinx-languages)))

;; use emacs-jinx package from guix if available
(use-package jinx
  :if (file-directory-p "~/.guix-profile/share/emacs/site-lisp") ;only install on guix system
  :ensure nil
  :load-path "~/.guix-profile/share/emacs/site-lisp/jinx-1.9/"
  :hook (emacs-startup . global-jinx-mode)
  :bind (("M-$" . jinx-correct)
         ("C-M-$" . jinx-languages)))

;; (add-hook 'emacs-startup-hook #'global-jinx-mode)
;; (keymap-global-set "M-$" #'jinx-correct)
;; (keymap-global-set "C-M-$" #'jinx-languages)
;; (keymap-global-set "M-p" #'jinx-previous)
;; (keymap-global-set "M-n" #'jinx-next)

(use-package hl-todo
  :hook ((prog-mode . hl-todo-mode)
         (org-mode . hl-todo-mode))
  :config
  ;; (keymap-set hl-todo-mode-map "C-c p" #'hl-todo-previous)
  ;; (keymap-set hl-todo-mode-map "C-c n" #'hl-todo-next)
  ;; (keymap-set hl-todo-mode-map "C-c o" #'hl-todo-occur)
  ;; (keymap-set hl-todo-mode-map "C-c i" #'hl-todo-insert)
  (setq hl-todo-keyword-faces
        '(("TODO"   . "#FF0000")
          ("FIXME"  . "#FF0000")
          ("DEBUG"  . "#A020F0")
          ("GOTCHA" . "#FF4500")
          ("STUB"   . "#1E90FF"))))
