emacs/Emacs.org
** rainbow delimiters
match brackets and other delimiters by color to see the current scope more easily
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
** auto close brackets FIXME 
*** smartparens
#+begin_src emacs-lisp
  (use-package smartparens-mode
    :ensure smartparens
    :hook (prog-mode text-mode markdown-mode)
    :config
    (require 'smartparens-config))
#+end_src
*** auto close brackets
automatically add closing brackets, via electric-mode
#+begin_src emacs-lisp :tangle no
  (electric-pair-mode t)
#+end_src
*** auto indent
auto indent
#+begin_src emacs-lisp
  (electric-indent-mode t)
  ;; (electric-quote-mode t)
  (setq minibuffer-default-prompt-format " [%s]") ; Emacs 29
  (minibuffer-electric-default-mode 1)
#+end_src
* development
** git
*** magit
TODO: add checkout shortcut
#+begin_src emacs-lisp
  (use-package magit
    :bind (("C-x g" . magit)
           ("C-x c" . magit-clone-shallow)))
#+end_src
**** keychain-evnvironment
to prevent being asked to type the ssh/gpg-key password on every action, make sure magit knows the ssh-key-agents location via =keychain-evnvironment=:
#+begin_src emacs-lisp :tangle no
  (use-package keychain-environment
    :hook ((magit . keychain-environment)))
#+end_src
**** magit-todo
Show source files' TODOs (and FIXMEs, etc) in Magit status buffer
#+begin_src emacs-lisp
  (use-package magit-todos
    :after magit
    :config (magit-todos-mode 1))
#+end_src
*** forge
Forge allows you to work with Git forges, currently Github and Gitlab, from the comfort of Magit and Emacs.
#+begin_src emacs-lisp :tangle no
  (use-package forge
    :after magit)
#+end_src
*** diff-hl
highlight uncommitted, changed lines on the side of a buffer
#+begin_src emacs-lisp
  (use-package diff-hl
    :hook ((text-mode . diff-hl-mode)
           (org-mode . diff-hl-mode)
           (prog-mode . diff-hl-mode)
           ;; (dired-mode . diff-hl-dired-mode)
           ))
#+end_src
** tree-sitter
automatically detect the appropriate tree-sitter mode dependent on the language mode and file type
#+begin_src emacs-lisp
  (use-package treesit-auto
    :custom
    (treesit-auto-install 'prompt)
    :config
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))
#+end_src
** languages
*** markdown
#+begin_src emacs-lisp
  (use-package markdown-mode
    :mode ("\\.md\\'" . markdown-mode)
    :config (setq markdown-command "multimarkdown"))
#+end_src
*** shell (disabled)
enable shellcheck using flymake for checking correctness and scanning common mistakes in shell-code
#+begin_src emacs-lisp :tangle no
  (use-package flymake-shellcheck
    :hook (bash-ts-mode . flymake-shellcheck-mode))
#+end_src
*** rust-ts-mode get info regarding indentation from rustfmt.toml
#+begin_src emacs-lisp
  (use-package toml)
  (require 'toml)

  (defun my-rust-ts--apply-rustfmt-config (rustfmt-data)
    "Apply settings from RUSTFMT-DATA to the current buffer.
  RUSTFMT-DATA is an alist parsed from rustfmt.toml."
    (let ((hard-tabs (alist-get "hard_tabs" rustfmt-data nil nil #'equal))
          (tab-spaces (alist-get "tab_spaces" rustfmt-data nil nil #'equal)))
      (message "rustfmt config: hard_tabs: %s; tab_spaces: %s" hard-tabs tab-spaces)
      (when (eq hard-tabs t)
        (setq-local indent-tabs-mode t))
      (if tab-spaces
  	(setq-local tab-width tab-spaces)
        (setq-local tab-width 4))))

  (defun my-rust-ts--find-and-apply-rustfmt-config ()
    "Look for a rustfmt.toml file in the current project tree and apply its settings."
    (let ((root (locate-dominating-file default-directory "rustfmt.toml")))
      (when root
        (let ((rustfmt-file (expand-file-name "rustfmt.toml" root)))
          (when (file-exists-p rustfmt-file)
  	  (message "using rustfmt.toml file: %s" (rustfmt-file))
            (condition-case err
                (let ((data (toml:read-from-file rustfmt-file)))
  		(message "data: %s" data)
                  (my-rust-ts--apply-rustfmt-config data))
              (error (message "Error parsing rustfmt.toml: %s" err))))))))

  (add-hook 'rust-ts-mode-hook #'my-rust-ts--find-and-apply-rustfmt-config)
#+end_src
#+begin_src emacs-lisp :tangle no
  (defun my-rust-ts-mode-tab-setup ()
    "Configure `rust-ts-mode' to use tabs for indentation."
    (setq indent-tabs-mode t)
    (setq tab-width 4))

  (add-hook 'rust-ts-mode-hook #'my-rust-ts-mode-tab-setup)
#+end_src
*** rust-mode (not used)
#+begin_src emacs-lisp :tangle no
  (defvar rust-mode-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "C-c C-d") #'rust-dbg-wrap-or-unwrap)
      (when rust-load-optional-libraries
        (define-key map (kbd "C-c C-c C-u") 'rust-compile)
        (define-key map (kbd "C-c C-c C-k") 'rust-check)
        (define-key map (kbd "C-c C-c C-t") 'rust-test)
        (define-key map (kbd "C-c C-c C-r") 'rust-run)
        (define-key map (kbd "C-c C-c C-l") 'rust-run-clippy)
        (define-key map (kbd "C-c C-f") 'rust-format-buffer)
        (define-key map (kbd "C-c C-n") 'rust-goto-format-problem))
      map)
    "Keymap for Rust major mode.")
#+end_src
*** ruby
#+begin_src emacs-lisp :tangle no
  (use-package erblint
    :hook (ruby-ts-mode . erblint-mode))
#+end_src
*** elm
#+begin_src emacs-lisp :tangle no
  (use-package elm-mode
    :defer t
    :mode ("\\.elm\\'". elm-mode)
    :config
    (setq elm-mode-hook '(elm-indent-simple-mode))
    (add-hook 'elm-mode-hook 'elm-format-on-save-mode))
#+end_src
*** php
#+begin_src emacs-lisp
  (use-package php-mode)
#+end_src
*** webmode
#+begin_src emacs-lisp
  (use-package web-mode
    :defer t
    :config
    (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode)))
#+end_src
*** makefile
auto enable makefile-mode for Makefiles
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\Makefile\\'" . makefile-mode))
#+end_src
*** c-ts-mode: use linux coding style
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.c\\'" . c-ts-mode))
  (add-hook 'c-ts-mode-hook (lambda () (c-ts-mode-set-global-style 'linux)
                              (when (eq c-ts-mode-indent-style 'linux)
                                (setq c-ts-mode-indent-offset 8)
                                (setq comment-style 'extra-line))))
#+end_src
** flymake
finding syntax errors on the fly, also works with eglot and spellcheck (it also might be worth checking out [[https://www.flycheck.org] [Flycheck]])
#+begin_src emacs-lisp
  ;; (define-key flymake-mode-map (kbd "M-n") 'flymake-goto-next-error)
  ;; (define-key flymake-mode-map (kbd "M-p") 'flymake-goto-prev-error)
  (global-set-key (kbd "M-n") 'flymake-goto-next-error)
  (global-set-key (kbd "M-p") 'flymake-goto-prev-error)
#+end_src
** eglot
add keybindings for when in eglot-mode (Emacs' built in language-server)
#+begin_src emacs-lisp
  (require 'eglot)
  (setq eglot-events-buffer-size 0) ;disable logging and improve perfomance
  (define-key eglot-mode-map (kbd "C-c c r") 'eglot-rename)
  (define-key eglot-mode-map (kbd "C-c c o") 'eglot-code-action-organize-imports)
  (define-key eglot-mode-map (kbd "C-c c h") 'eldoc)
  (define-key eglot-mode-map (kbd "C-c c a") 'eglot-code-actions)
  (define-key eglot-mode-map (kbd "C-c c f") 'eglot-format-buffer)
  (define-key eglot-mode-map (kbd "C-c c q") 'eglot-code-action-quickfix)
  (define-key eglot-mode-map (kbd "C-c c e") 'eglot-code-action-extract)
  (define-key eglot-mode-map (kbd "<f6>") 'xref-find-definitions)
  (define-key eglot-mode-map (kbd "M-.") 'xref-find-definitions)
#+end_src
** compile-mode
scroll to bottom in compile mode output buffer
#+begin_src emacs-lisp
  (setq compilation-scroll-output 'first-error)
#+end_src
** which-function-mode
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'which-function-mode)
#+end_src
** debugging
#+begin_src emacs-lisp :tangle no
  (use-package dape)
  ;; (setq dap-auto-configure-features '(sessions locals controls tooltip))
#+end_src
* applications
** restclient
manually explore and test HTTP REST webservices
#+begin_src emacs-lisp
  (use-package restclient
    :defer t)
#+end_src
** dired
*** show file icons
#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :after all-the-icons
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
*** show sizes of all files in human readable format
#+begin_src emacs-lisp
  (setq dired-listing-switches "-alh")
#+end_src
*** show sizes of folders
#+begin_src emacs-lisp
  (use-package dired-du
    :after dired
    :config (setq dired-du-size-format t))
#+end_src
*** automatically update dired buffers on revisiting their directory
#+begin_src emacs-lisp
  (setq dired-auto-revert-buffer t)
#+end_src
*** extract tar.gz contents in subfolder instead of the current dir
#+begin_src emacs-lisp
  (setq dired-guess-shell-alist-user
        '(("\\.tar\\.gz\\'"
           "b=$(basename ? .tar.gz); mkdir -p \"$b\"; tar xzf ? -C \"$b\"")
          ("\\.tar\\.bz2\\'"
           "b=$(basename ? .tar.bz2); mkdir -p \"$b\"; tar xjf ? -C \"$b\"")
          ("\\.tar\\.xz\\'"
           "b=$(basename ? .tar.xz); mkdir -p \"$b\"; tar xJf ? -C \"$b\"")
          ("\\.tar\\'"
           "b=$(basename ? .tar); mkdir -p \"$b\"; tar xf ? -C \"$b\"")
          ("\\.zip\\'"
           "b=$(basename ? .zip); mkdir -p \"$b\"; unzip ? -d \"$b\"")
  	("\\.rar\\'"
  	 "b=$(basename ? .rar); mkdir -p \"$b\"; unrar ? \"$b\"")))
#+end_src
*** make dired guess the target directory when copying
#+begin_src emacs-lisp
  (setq dired-dwim-target t)
#+end_src
** elf-feed
subscribe to rss-feeds
#+begin_src emacs-lisp
  (use-package elfeed
    :bind ("C-x w" . elfeed)
    :config
    (setq elfeed-feeds
          '("http://nullprogram.com/feed/"
            "https://mccd.space/feed.xml"
            "https://dthompson.us/feed.xml"
            "https://planet.emacslife.com/atom.xml"
            "https://news.opensuse.org/feed.xml"
            "https://irreal.org/blog/?feed=rss2"
            "https://protesilaos.com/keeb.xml"
            "https://protesilaos.com/codelog.xml"
            "https://protesilaos.com/news.xml"
            "https://drewdevault.com/blog/index.xml"
  	  "https://lorendb.dev/index.xml"
  	  "https://0pointer.net/blog/index.rss20"
            ;; "https://archlinux.org/feeds/news/"
            "https://blogs.kde.org/index.xml")))
#+end_src
** nov.el
read ebooks in ebpub format
#+begin_src emacs-lisp
  (use-package nov
    :mode ("\\.epub\\'" . nov-mode))
  ;; (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
  ;; :commands nov)
#+end_src
** vterm
complete terminal in Emacs
#+begin_src emacs-lisp :tangle no
  (use-package vterm
    :defer t
    :commands vterm)
#+end_src
** eshell
set M-RET shortcut for opening eshell
#+begin_src emacs-lisp
  (global-set-key (kbd "M-RET") 'eshell)
#+end_src
** pdf-tools
better interaction with pdf
#+begin_src emacs-lisp
  (use-package pdf-tools
    :if (not (file-directory-p "~/.guix-profile/share/emacs/site-lisp")) ;only install on non guix system
    :mode ("\\.pdf\\'" . pdf-view-mode))
  (use-package pdf-tools
    :if (file-directory-p "~/.guix-profile/share/emacs/site-lisp") ;only install on guix system
    :ensure nil
    :load-path "~/.guix-profile/share/emacs/site-lisp/pdf-tools-1.1.0"
    :mode ("\\.pdf\\'" . pdf-view-mode))
#+end_src
