emacs/.config/emacs/init.el

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package smartparens-mode
  :ensure smartparens
  :hook (prog-mode text-mode markdown-mode)
  :config
  (require 'smartparens-config))

(electric-indent-mode t)
;; (electric-quote-mode t)
(setq minibuffer-default-prompt-format " [%s]") ; Emacs 29
(minibuffer-electric-default-mode 1)

(use-package magit
  :bind (("C-x g" . magit)
         ("C-x c" . magit-clone-shallow)))

(use-package magit-todos
  :after magit
  :config (magit-todos-mode 1))

(use-package diff-hl
  :hook ((text-mode . diff-hl-mode)
         (org-mode . diff-hl-mode)
         (prog-mode . diff-hl-mode)
         ;; (dired-mode . diff-hl-dired-mode)
         ))

(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

(use-package markdown-mode
  :mode ("\\.md\\'" . markdown-mode)
  :config (setq markdown-command "multimarkdown"))

(use-package php-mode)

(use-package web-mode
  :defer t
  :config
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode)))

(add-to-list 'auto-mode-alist '("\\Makefile\\'" . makefile-mode))

(add-to-list 'auto-mode-alist '("\\.c\\'" . c-ts-mode))
(add-hook 'c-ts-mode-hook (lambda () (c-ts-mode-set-global-style 'linux)
                            (when (eq c-ts-mode-indent-style 'linux)
                              (setq c-ts-mode-indent-offset 8)
                              (setq comment-style 'extra-line))))

;; (define-key flymake-mode-map (kbd "M-n") 'flymake-goto-next-error)
;; (define-key flymake-mode-map (kbd "M-p") 'flymake-goto-prev-error)
(global-set-key (kbd "M-n") 'flymake-goto-next-error)
(global-set-key (kbd "M-p") 'flymake-goto-prev-error)

(require 'eglot)
(setq eglot-events-buffer-size 0) ;disable logging and improve perfomance
(define-key eglot-mode-map (kbd "C-c c r") 'eglot-rename)
(define-key eglot-mode-map (kbd "C-c c o") 'eglot-code-action-organize-imports)
(define-key eglot-mode-map (kbd "C-c c h") 'eldoc)
(define-key eglot-mode-map (kbd "C-c c a") 'eglot-code-actions)
(define-key eglot-mode-map (kbd "C-c c f") 'eglot-format-buffer)
(define-key eglot-mode-map (kbd "C-c c q") 'eglot-code-action-quickfix)
(define-key eglot-mode-map (kbd "C-c c e") 'eglot-code-action-extract)
(define-key eglot-mode-map (kbd "<f6>") 'xref-find-definitions)
(define-key eglot-mode-map (kbd "M-.") 'xref-find-definitions)

(setq compilation-scroll-output 'first-error)

(use-package restclient
  :defer t)

(use-package all-the-icons-dired
  :after all-the-icons
  :hook (dired-mode . all-the-icons-dired-mode))

(setq dired-listing-switches "-alh")

(setq dired-auto-revert-buffer t)

(setq dired-dwim-target t)

(use-package elfeed
  :bind ("C-x w" . elfeed)
  :config
  (setq elfeed-feeds
        '("http://nullprogram.com/feed/"
          "https://mccd.space/feed.xml"
          "https://dthompson.us/feed.xml"
          "https://planet.emacslife.com/atom.xml"
          "https://archlinux.org/feeds/news/")))

(use-package nov
  :mode ("\\.epub\\'" . nov-mode))
;; (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
;; :commands nov)

(global-set-key (kbd "M-RET") 'eshell)

(use-package pdf-tools
  :if (not (file-directory-p "~/.guix-profile/share/emacs/site-lisp")) ;only install on non guix system
  :mode ("\\.pdf\\'" . pdf-view-mode))
(use-package pdf-tools
  :if (file-directory-p "~/.guix-profile/share/emacs/site-lisp") ;only install on guix system
  :ensure nil
  :load-path "~/.guix-profile/share/emacs/site-lisp/pdf-tools-1.1.0"
  :mode ("\\.pdf\\'" . pdf-view-mode))
