emacs/Emacs.org
** emacs-everywhere (not working)
use ~emacsclient --eval "(emacs-everywhere)"~ from another window when writing text to open this text in an Emacs buffer. Type =C-c C-c= to reinsert the edited text into the text field.
*Warning!* this does currently not work under Wayland
#+begin_src emacs-lisp :tangle no
  (use-package emacs-everywhere)
#+end_src
** ollama
#+begin_src emacs-lisp
  (use-package ellama
    :bind ("C-c e" . ellama-transient-main-menu)
    :init
    (setopt ellama-chat-display-action-function #'display-buffer-full-frame)
    (setopt ellama-instant-display-action-function #'display-buffer-at-bottom)
    :config
    ;; send last message in chat buffer with C-c C-c
    (add-hook 'org-ctrl-c-ctrl-c-hook #'ellama-chat-send-last-message))
#+end_src
** casual
#+begin_src emacs-lisp
  (use-package casual)
#+end_src
*** casual-calc
#+begin_src emacs-lisp
  (require 'casual-calc)
  (keymap-set calc-mode-map "C-o" #'casual-calc-tmenu)
  (keymap-set calc-alg-map "C-o" #'casual-calc-tmenu)
#+end_src
*** casual-image
#+begin_src emacs-lisp
  (require 'casual-image)
  (keymap-set image-mode-map "C-o" #'casual-image-tmenu)
#+end_src
** email
*** filtering with notmuch
#+begin_src emacs-lisp
  (use-package notmuch
    :commands notmuch
    :bind (:map global-map ("C-c m" . notmuch)
                :map notmuch-hello-mode-map ("G" . mbsync)
                :map notmuch-search-mode-map ("G" . mbsync)))
#+end_src
*** syncing with mbsync
#+begin_src emacs-lisp
  (use-package mbsync
    :commands mbsync
    :config
    (add-hook 'mbsync-exit-hook 'notmuch-poll-and-refresh-this-buffer))
#+end_src
* runtime performance
make garbage-collection pauses faster by decreasing the threshold, increasing the runtime performance
#+begin_src emacs-lisp :tangle no
  (setq gc-cons-threshold (* 10 1000 1000)) ;10mb
#+end_src
* TODO
+ look into [[https://protesilaos.com/codelog/2024-11-28-basic-emacs-configuration/][Emacs: a basic and capable configuration | Protesilaos Stavrou]]
+ use tabs for indentation and make them "sticky"???
+ email
  + gnus
  + rmail
  + mu4e: [[https://www.youtube.com/watch?v=yZRyEhi4y44&pp=ygULZW1hY3MgZW1haWw%3D][Streamline Your E-mail Management with mu4e - Emacs Mail - YouTube]]
+ handle passwords: [[https://www.youtube.com/watch?v=nZ_T7Q49B8Y][How to Encrypt Your Passwords with Emacs - YouTube]]
  [[https://github.com/daviwil/dotfiles/blob/master/.emacs.d/modules/dw-auth.el][dotfiles/.emacs.d/modules/dw-auth.el at master · daviwil/dotfiles · GitHub]]
+ inline git blame
* look into
+ [[https://www.youtube.com/watch?v=PMWwM8QJAtU][Emacs From Scratch #10 - Effortless File Management with Dired - YouTube]]
+ https://git.sr.ht/~technomancy/better-defaults/
+ look into new .el files in this directory
+ irc: [[https://www.youtube.com/watch?v=qWHTZIYTA4s&list=PLEoMzSkcN8oMMcPnYlNbQkUInjUxB75wE&pp=iAQB][Chat Like the 90's in Emacs with ERC - YouTube]]
+ [[https://github.com/Wilfred/deadgrep?tab=readme-ov-file][GitHub - Wilfred/deadgrep: fast, friendly searching with ripgrep and Emacs]]
+ wdired [[https://xenodium.com/emacs-git-rename-courtesy-of-dired/][Emacs: git rename, courtesy of dired]]
+ [[https://www.emacswiki.org/emacs/HippieExpand][EmacsWiki: Hippie Expand]]
+ [[https://github.com/emacs-sideline/sideline][GitHub - emacs-sideline/sideline: Show information on the side]]
+ for eshell [[https://github.com/xenodium/dotsies][GitHub - xenodium/dotsies: Dot files, Emacs config, etc]]
+ [[https://github.com/bbatsov/crux][GitHub - bbatsov/crux: A Collection of Ridiculously Useful eXtensions for Emacs]]
+ [[https://github.com/emacs-eaf/emacs-application-framework/?tab=readme-ov-file][GitHub - emacs-eaf/emacs-application-framework: EAF, an extensible framework ...]]
+ [[https://github.com/d12frosted/flyspell-correct][GitHub - d12frosted/flyspell-correct: Distraction-free words correction with ...]]
+ look at my doom config
+ [[https://github.com/tmalsburg/helm-bibtex][GitHub - tmalsburg/helm-bibtex: Search and manage bibliographies in Emacs]]
  [[https://orgmode.org/manual/Citations.html][Citations (The Org Manual)]]
+ [[https://github.com/Fuco1/smartparens][GitHub - Fuco1/smartparens: Minor mode for Emacs that deals with parens pairs...]]
+ avy [[https://github.com/abo-abo/avy][GitHub - abo-abo/avy: Jump to things in Emacs tree-style]]
+ embark [[https://protesilaos.com/codelog/2024-02-17-emacs-modern-minibuffer-packages/][Emacs: modern minibuffer packages (Vertico, Consult, etc.) | Protesilaos Stavrou]]
+ wgrep [[https://protesilaos.com/codelog/2024-02-17-emacs-modern-minibuffer-packages/][Emacs: modern minibuffer packages (Vertico, Consult, etc.) | Protesilaos Stavrou]]
+ org-present
+ interact with system trash [[https://github.com/shingo256/trashed][GitHub - shingo256/trashed: Viewing/editing system trash can in Emacs]]
+ xref navigation integration with consult [[https://github.com/brett-lempereur/consult-xref-stack][GitHub - brett-lempereur/consult-xref-stack: Navigate the Xref stack with Con...]]
+ treemacs
+ [[https://github.com/jdtsmith/speedrect][GitHub - jdtsmith/speedrect: Quick key bindings and other tools for rectangle...]]
+ denote instead of org-roam
+ ibuffer
+ deft
+ useful but not needed
  ruby
  [[https://github.com/pezra/rspec-mode][GitHub - pezra/rspec-mode: An RSpec minor mode for Emacs]]
+ editorconfig
+ look into: [[https://github.com/SystemCrafters/crafted-emacs][GitHub - SystemCrafters/crafted-emacs: A sensible base Emacs configuration.]]
+ instead of auto-ts-mode [[https://github.com/emacs-tree-sitter/tree-sitter-langs][GitHub - emacs-tree-sitter/tree-sitter-langs: Language bundle for Emacs's tre...]]
+ [[https://github.com/LionyxML/auto-dark-emacs][GitHub - LionyxML/auto-dark-emacs: Auto-Dark-Emacs is an auto changer between...]]
+ gcmh: dynamic garbage collection for improving speed
+ Combobulate: https://github.com/mickeynp/combobulate uses Tree-Sitter to provide a structured movement within your code [[https://www.masteringemacs.org/article/combobulate-structured-movement-editing-treesitter][Combobulate: Structured Movement and Editing with Tree-Sitter]]
+ crafted org config: [[file:~/crafted-emacs/docs/crafted-org.org]]
+ [[https://github.com/mclear-tools/tabspaces][GitHub - mclear-tools/tabspaces]]
+ [[https://cachestocaches.com/2017/3/complete-guide-email-emacs-using-mu-and/][A Complete Guide to Email in Emacs using Mu and Mu4e]]
[[https://arialdomartini.github.io/emacs-zoom][+ Emacs: let's zoom]]
+ https://www.reddit.com/r/emacs/comments/1h1d5k4/how_to_potentially_make_your_eglot_completions/
+ https://www.reddit.com/r/emacs/comments/1h2o8hr/share_your_mx_compile_compilationmode_config/
** from doom
+ format+ onsave
+ grammar
