emacs/.config/emacs/init.el

(use-package notmuch
  :commands notmuch
  :bind (:map global-map ("C-c m" . notmuch)
              :map notmuch-hello-mode-map ("G" . mbsync)
              :map notmuch-search-mode-map ("G" . mbsync)))

(use-package mbsync
  :commands mbsync
  :config
  (add-hook 'mbsync-exit-hook 'notmuch-poll-and-refresh-this-buffer))
